#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for dev</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.thumb_flow.aws_iam_policy.thumbnail_function_sqs_receive will be created
  + resource "aws_iam_policy" "thumbnail_function_sqs_receive" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows thumbnail generator function to receive messages from SQS"
      + id               = (known after apply)
      + name             = "thumbflow-thumbnail-generator-dev-sqs-receive-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_policy.upload_function_sqs_publish will be created
  + resource "aws_iam_policy" "upload_function_sqs_publish" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Allows upload Lambda function to publish messages to SQS"
      + id               = (known after apply)
      + name             = "thumbflow-upload-handler-dev-sqs-publish-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.thumbnail_function_sqs_receive will be created
  + resource "aws_iam_role_policy_attachment" "thumbnail_function_sqs_receive" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-thumbnail-generator-dev-execution-role"
    }

  # module.thumb_flow.aws_iam_role_policy_attachment.upload_function_sqs_publish will be created
  + resource "aws_iam_role_policy_attachment" "upload_function_sqs_publish" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "thumbflow-upload-handler-dev-execution-role"
    }

  # module.thumb_flow.aws_lambda_event_source_mapping.thumbnail_generator_sqs_trigger will be created
  + resource "aws_lambda_event_source_mapping" "thumbnail_generator_sqs_trigger" {
      + arn                           = (known after apply)
      + batch_size                    = 1
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = "arn:aws:lambda:us-east-1:099670157298:function:thumbflow-thumbnail-generator-dev"
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + region                        = "us-east-1"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.thumb_flow.module.thumbnail_generation_queue.aws_sqs_queue.this will be created
  + resource "aws_sqs_queue" "this" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 86400
      + name                              = "thumbflow-thumbnail-generation-queue-dev"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "us-east-1"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + tags_all                          = {
          + "Environment" = "dev"
          + "ManagedBy"   = "terraform"
          + "Project"     = "ThumbFlow"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 120
    }

  # module.thumb_flow.module.thumbnail_generator_function.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "thumbflow-thumbnail-generator-dev"
      ~ image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/thumbnail-generator:7dba260d5695553abc4d056ccc71ca5bf70b0962-16696781109" -> "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/thumbnail-generator:b74fc2b5834719328c925e6010a448d81249d237-16709744153"
      ~ last_modified                  = "2025-08-02T19:07:05.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "ThumbFlow"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AWS_S3_RAW_BUCKET_NAME"       = "thumbflow-raw-images-bucket-dev"
              - "AWS_S3_THUMBNAIL_BUCKET_NAME" = "thumbflow-thumbnails-bucket-dev"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.thumb_flow.module.upload_function.aws_lambda_function.this will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "thumbflow-upload-handler-dev"
      ~ image_uri                      = "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/upload-handler:7dba260d5695553abc4d056ccc71ca5bf70b0962-16696781109" -> "099670157298.dkr.ecr.us-east-1.amazonaws.com/blumek/upload-handler:b74fc2b5834719328c925e6010a448d81249d237-16709744153"
      ~ last_modified                  = "2025-08-02T19:06:59.000+0000" -> (known after apply)
        tags                           = {
            "Environment" = "dev"
            "ManagedBy"   = "terraform"
            "Project"     = "ThumbFlow"
        }
        # (27 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "AWS_S3_BUCKET_NAME" = "thumbflow-raw-images-bucket-dev"
            } -> (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

Plan: 6 to add, 2 to change, 0 to destroy.
```

</details>

*Pusher: @blumek, Action: `pull_request`*